# MaterialAssetParamAssetLibId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MaterialAssetParamAssetLibId Property
ParameterTypeId Class See Also
---
"Asset library id"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MaterialAssetParamAssetLibId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MaterialAssetParamAssetLibId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MaterialAssetParamAssetLibId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace